[{
    "name": "Realtor Block",
    "slug": "realtor-block",
    "type": "web",
    "jobType": "Hobby",
    "techStack": [
      "Next.js",
      "Supabase",
      "ShadCn",
      "Tailwind CSS",
      "Lucide React",
      "Formik",
      "Google Maps API",
      "Clerk",
      "Supabase PostgreSQL",
      "Supabase Storage"
    ],
    "description": "A modern, full-stack real estate platform built with Next.js that allows users to browse, search, and manage property listings with interactive maps and comprehensive filtering options.",
 "longDescription": "Realtor Block is a comprehensive, full-stack real estate platform designed to provide a seamless and modern property browsing experience. Built with Next.js and styled with Tailwind CSS, the platform delivers a mobile-first, responsive design that ensures accessibility across all devices. It features secure user authentication and profile management through Clerk, enabling account creation, login via email and social providers, and session handling for persistent logins.The application empowers real estate agents to manage their listings with robust property management tools, including the ability to add, edit, and remove property details, assign agents, and toggle listing availability. Listings are enriched with high-quality image uploads, handled via Supabase Storage with public access policies, unique filenames, and automatic optimization to ensure fast delivery and scalability. Each property can be described with details such as number of bedrooms, bathrooms, parking spaces, property type, utilities, and contact agent section, all stored in a relational Supabase PostgreSQL database designed with normalized schema, relationships, and Row Level Security policies for secure data handling. To enhance discovery, Realtor Block integrates with the Google Maps API and Google Places API to deliver a powerful geolocation experience. Users can browse properties directly on an interactive map, with location markers, custom styling, zoom controls, and responsive map containers. The advanced search system allows address-based lookups, autocomplete suggestions, and geocoding support, while property filters enable narrowing results by features such as bedrooms, bathrooms, parking, and type. This ensures a highly personalized and efficient property search journey. From a technical perspective, the project embraces a modular architecture with Next.js App Router, organized route groups for listings, agents, authentication, and shared UI components. Core features such as real-time updates, and form management with Formik make interactions seamless and responsive. Supabase PostgreSQL powers structured data storage, with dedicated tables for listings and listing images, while Supabase Storage ensures scalable and secure media management. Developers can easily set up the project by configuring environment variables for Clerk, Supabase, and Google Cloud APIs. The platform is built to scale, optimized for performance and maintainability, with linting via ESLint and TypeScript support. Overall, Realtor Block is not only a practical tool for property seekers and agents but also a showcase of a modern, production-ready full-stack application that integrates authentication, database management, file storage, and third-party APIs into a polished, user-centric solution.",

    "featuredImage": "/media/projects/realtor-block-featured.png",
    "images": [
      "/media/projects/page-images/realtor-block-1.png",
      "/media/projects/page-images/realtor-block-2.png",
      "/media/projects/page-images/realtor-block-3.png",
      "/media/projects/page-images/realtor-block-4.png",
      "/media/projects/page-images/realtor-block-5.png",
      "/media/projects/page-images/realtor-block-6.png",
      "/media/projects/page-images/realtor-block-7.png",
      "/media/projects/page-images/realtor-block-8.png",
      "/media/projects/page-images/realtor-block-9.png",
      "/media/projects/page-images/realtor-block-10.png",
      "/media/projects/page-images/realtor-block-11.png",
      "/media/projects/page-images/realtor-block-12.png",
      "/media/projects/page-images/realtor-block-13.png"
    ],
    "live": "https://realtor-block.vercel.app",
    "featured": true
  },
  {
    "name": "Bedge Pictures",
    "slug": "bedge-pictures",
    "type": "web",
    "jobType": "Freelance",
    "techStack": ["Next.js", "GSAP", "TailwindCSS", "Lucide Icons", "GA4", "GTM", "Playwright", "Woocommerce"],
    "description": "A modern photography website built with Next.js, featuring a blog, shop, and gallery.",
    "longDescription": "I built a modern, fully responsive website for Bedge Pictures — a wedding and engagement photography brand using Next.js for its performance, flexibility, and built-in routing and image optimization features. The site is structured with the App Router and includes a blog, a curated collection of wedding stories, a digital product shop, and a full-screen image gallery to showcase high-resolution photography. I chose Next.js to ensure fast loading, SEO-friendly pages, and the ability to scale easily with future content. I used Markdown files to manage blog posts and wedding stories because it allows for a clean, version-controlled content workflow without the overhead of a CMS. This setup makes it easy to update or write new posts directly from a developer environment while keeping the codebase lightweight and fast.The contact form is custom-built and features secure submission using Nodemailer with SMTP credentials and Google reCAPTCHA to prevent spam. I also utilized both Vercel and Google Analytics for deep performance and engagement insights. Additional features include support for Next theme for dark/light themes based on user preferences, GSAP animations for subtle motion effects, and a separate WooCommerce on the subdomain for his digital shop. The entire platform is optimized for both mobile and desktop experiences, reflecting the polished, story-driven aesthetic of the brand.",
    "featuredImage": "/media/projects/bedge-featured.png",
    "images": [
      "/media/projects/page-images/bedge-pictures-1.png",
      "/media/projects/page-images/bedge-pictures-2.png"
    ],
    "live": "https://bedgepictures.com",
     "featured": false
    
  },
  {
    "name": "BOAS",
    "slug": "boas",
    "type": "web",
    "jobType": "Full Time",
    "techStack": ["Shopify", "Next.js", "GraphQL", "Typescript", "Strapi", "Liquid"],
    "description": "Started as a Shopify developer using Liquid, then helped rebuild the storefront using Next.js, Strapi, and the Storefront API in a headless setup.",
    "longDescription": "BOAS is a jeans wholesale company that specializes in providing high-quality denim products to retailers and businesses. With a focus on sustainability and ethical production, they focus on donating larger chunk of the proceeds to charity. At BOAS, I was initially hired as a Shopify developer working with Liquid to build and maintain custom features. I also helped develop a private Shopify app tailored to the store’s unique operational needs. Later, as part of the development team, I contributed to the transition to a headless architecture using Next.js for the frontend, Strapi for content management, and the Shopify Storefront API for product data and checkout. I helped build dynamic product pages, category listings, and reusable UI components, while improving performance, flexibility, and editorial control.The new architecture made it easier for the marketing team to manage content and allowed the team to deliver a faster, more customizable shopping experience.",
    "featuredImage": "/media/projects/boas-featured.png",
    "images": [
      "/media/projects/page-images/boas-1.png",
      "/media/projects/page-images/boas-2.png"
    ],
    "live": "https://boas.co",
    "featured": false
  },
  {
    "name": "WPS Bedge",
    "slug": "wps-bedge",
    "type": "web",
    "jobType": "Freelance",
    "techStack": ["Wordpress", "GA4", "Mailchimp", "GTM", "MySQL", "Recaptcha"],
    "description": "Photography Studio made for creatives to showcase their creativity.",
    "longDescription": "Discover the diverse world of WPS (Work & Play Studio), a Multi-Disciplinary Photography Studio that seamlessly blends creativity and expertise allowing creatives to showcase their creativity. With a focus on capturing the essence of each moment, WPS offers a range of services including photography, videography, and creative direction.",
    "featuredImage": "/media/projects/wps-featured.png",
    "images": [
      "/media/projects/page-images/wpsbedge-1.png",
      "/media/projects/page-images/wpsbedge-2.png"
    ],
    "live": "https://wpsbedge.com",
    "featured": false
  },

   {
    "name": "Lizz Davies",
    "slug": "lizz-davies",
    "type": "web",
    "jobType": "Freelance",
    "techStack": ["Wordpress", "GA4", "MySQL","GTM", "Recaptcha"],
    "description": "Photography Studio tmade for creatives to showcase their creativity.",
    "longDescription": "The Employee Voting System is a web application designed to facilitate voting among employees in an organization. It allows employees to cast their votes on various topics, ensuring transparency and engagement in decision-making processes.",
    "featuredImage": "/media/projects/lizzdavies-featured.png",
    "images": [
      "/media/projects/page-images/lizzdavies-1.png",
      "/media/projects/page-images/lizzdavies-2.png"
    ],
    "live": "https://lizzdavies.com",
    "featured": false
  },
  {
    "name": "Joke API",
    "slug": "joke-api",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["Express.js", "Node.js", "JSON", "REST API", "File System (FS)", "Marked.js", "Render"],
    "description": "A RESTful API for managing jokes, with full CRUD support and third-party API integration.",
    "longDescription": "The Joke API is a backend RESTful API built using Express.js and Node.js. It allows users to perform full CRUD operations on a collection of jokes stored in a local JSON file. It also integrates with jokeapi.dev to fetch programming jokes dynamically. The project features structured routing, middleware for joke validation, and Markdown-based documentation rendered on a /docs route using Marked.js. The API is deployed on Render and pinged every 5 minutes on uptimerobot.com to ensure uptime.",
    "featuredImage": "/media/projects/joke-api-featured.webp",
    "images": [
      "/media/projects/page-images/joke-api-1.png",
      "/media/projects/page-images/joke-api-2.png"
    ],
    "live": "https://jokes-api-gbee.onrender.com/",
    "featured": false
  },
  {
    "name": "Business Finder App",
    "slug": "business-finder-app",
    "type": "mobile",
    "jobType": "Hobby",
    "techStack": ["Kotlin", "Yelp Fusion", "Retrofit Api", "MVVM Design", "Coroutines", "Room Database"],
    "description": "A mobile app that helps you find businesses using Yelp Fusion API.",
    "longDescription": "The Business Finder App is a mobile application that allows users to search for businesses in their area using the Yelp Fusion API. The app provides a user-friendly interface and utilizes the MVVM design pattern for efficient data management.",
    "featuredImage": "/media/projects/yelp-app-featured.png",
    "images": [
      "/media/projects/page-images/kotlin-api-app-1.webp",
      "/media/projects/page-images/kotlin-api-app-2.gif"
    ],
    "live": "https://github.com/oviematthew/kotlin-api-project",
    "featured": false
  },

  {
    "name": "Personal Task Organizer",
    "slug": "personal-task-organizer",
    "type": "mobile",
    "jobType": "Hobby",
    "techStack": ["React Native", "Redux", "Expo", "Weather API", "Agile Design"],
    "description": "A mobile app that helps you organize your tasks.",
    "longDescription": "Ting is a mobile application built with React Native bootstrapped by expo, designed to help users manage and organize their tasks efficiently. State is managed using Redux, ensuring a smooth user experience. The app is designed with a focus on simplicity and usability, making it easy for users to add, edit, and delete tasks. User gets points for completing tasks, which can be redeemed for rewards. The app also includes a weather feature that provides users with real-time weather updates based on their location.",
    "featuredImage": "/media/projects/ting-featured.png",
    "images": [
      "/media/projects/page-images/ting-1.png",
      "/media/projects/page-images/ting-2.png"
    ],
    "live": "https://github.com/oviematthew/ting",
    "featured": false
  },
  {
    "name": "F10 Photography",
    "slug": "f10-photography",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["Wordpress", "GA4", "GTM", "GSAP", "Yoast SEO", "MySQL", "Recaptcha"],
    "description": "F10 Photography is a website designed to showcase the work of a wedding photographer.",
    "longDescription": "F10 Photography is a web application designed to showcase the work of a wedding photographer. The website features a clean and modern design, allowing users to easily navigate through the portfolio and view high-quality images.",
    "featuredImage": "/media/projects/f10-featured.png",
    "images": [
      "/media/projects/page-images/f10-1.png",
      "/media/projects/page-images/f10-2.png"
    ],
    "live": "https://f10studio.ca/",
    "featured": false
  },
   {
    "name": "Addict Wellness App",
    "slug": "chattee-app",
    "type": "mobile",
    "jobType": "Hobby",
    "techStack": ["React Native", "Firebase", "Firestore", "Gifted Chat",  "Firebase Auth", "TailwindCSS", "Headless UI"],
    "description": "Chattee is a mobile app that helps addicts find wellness.",
    "longDescription": "Chattee is a mobile application designed to assist individuals struggling with addiction in finding wellness and support. The app provides resources, community connections, and tools for recovery.",
    "featuredImage": "/media/projects/chatee-featured.png",
    "images": [
      "/media/projects/page-images/chattee-1.png",
      "/media/projects/page-images/chattee-2.png",
      "/media/projects/page-images/chattee-3.png",
      "/media/projects/page-images/chattee-4.png",
      "/media/projects/page-images/chattee-5.png",
      "/media/projects/page-images/chattee-7.png",
      "/media/projects/page-images/chattee-6.gif"

    ],
    "live": "https://github.com/oviematthew/chattee",
    "featured": false
  },
   {
    "name": "OCR To Text",
    "slug": "ocr-to-text",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["React", "REST API", "Bootstrap", "TailwindCSS", "Tesseract.js"],
    "description": "A web app that converts images to text using OCR.",
    "longDescription": "The OCR To Text web application allows users to upload images and convert them into editable text using Optical Character Recognition (OCR) technology. The app utilizes Tesseract.js for accurate text extraction.",
    "featuredImage": "/media/projects/imagetotext-featured.png",
    "images": [
      "/media/projects/page-images/ocr-1.png",
      "/media/projects/page-images/ocr-2.png"
    ],
    "live": "https://imagetotextapp.vercel.app/",
    "featured": false
  },
   {
    "name": "Hangman Game",
    "slug": "hangman-game",
    "type": "mobile",
    "jobType": "Hobby",
    "techStack": ["Swift", "Storyboard"],
    "description": "Explore Hangman where users take the reins in guessing while enjoying prompts and clues for an enhanced gameplay experience.",
    "longDescription": "Hangman is a classic word-guessing game where players try to guess a hidden word by suggesting letters within a certain number of guesses. The game features a user-friendly interface and engaging gameplay mechanics.",
    "featuredImage": "/media/projects/hangman-featured.png",
    "images": [
      "/media/projects/page-images/hangman-1.png",
      "/media/projects/page-images/hangman-2.png",
      "/media/projects/page-images/hangman-3.png",
      "/media/projects/page-images/hangman-4.png",
      "/media/projects/page-images/hangman-5.png",
      "/media/projects/page-images/hangman-6.png",
      "/media/projects/page-images/hangman-7.png"
    ],
    "live": "https://github.com/oviematthew/hangman-app",
    "featured": false
  },
  {
    "name": "Hidden Letter Game",
    "slug": "hidden-letter-game",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["React", "LocalStorage"],
    "description": "Hidden Letter game is a light-hearted game where users guess the hidden letter on a board of similar letters.",
    "longDescription": "Hidden Letter game is a fun 2d engaging game where users guess the hidden letter on a board of similar letters. The game features a user-friendly interface, and engaging gameplay mechanics.",
    "featuredImage": "/media/projects/hidden-letter-game-featured.png",
    "images": [
      "/media/projects/page-images/hidden-letter-game-1.png"
    ],
    "live": "https://hidden-letter-game.vercel.app/",
    "featured": false
  },
  {
    "name": "Weather App",
    "slug": "weather-app",
    "type": "mobile",
    "jobType": "Hobby",
    "techStack": ["Swift", "Storyboard", "MVVM Design", "Core Location", "Weather API"],
    "description": "A mobile app that helps you find the weather using Open Weather API.",
    "longDescription": "The Weather App is a mobile application that provides users with real-time weather information using the Open Weather API. The app is designed with a user-friendly interface and follows the MVVM design pattern for efficient data handling. It also utilizes Core Location to provide location-based weather updates.",
    "featuredImage": "/media/projects/weather-app-featured.png",
    "images": [
      "/media/projects/page-images/weather-2.png",
      "/media/projects/page-images/weather-1.png",
      "/media/projects/page-images/weather-3.png"
    ],
    "live": "https://github.com/oviematthew/weather-app-swift",
    "featured": false
  },
  {
    "name": "Employee Voting System",
    "slug": "employee-voting-system",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["React", "React Router", "Firestore", "Firebase Auth", "TailwindCSS", "Headless UI"],
    "description": "Best In Uniform is a voting system for employees.",
    "longDescription": "The Employee Voting System is a web application designed to facilitate voting among employees in an organization. It allows employees to cast their votes on various topics, ensuring transparency and engagement in decision-making processes.",
    "featuredImage": "/media/projects/best-in-uniform-featured.png",
    "images": [
      "/media/projects/page-images/best-in-uniform-1.png",
      "/media/projects/best-in-uniform-featured.png"
    ],
    "live": "https://bestinuniform980-9w9y.vercel.app/",
    "featured": false
  },

  {
    "name": "Jeopardy Game",
    "slug": "jeopardy-game",
    "type": "web",
    "jobType": "Hobby",
    "techStack": ["HTML5", "CSS3", "JS", "REST API"],
    "description": "A web app that helps you play Jeopardy. using Jservice.io API.",
    "longDescription": "The Jeopardy Game is a web application that allows users to play the classic game of Jeopardy. The app fetches questions from the Jservice.io API and provides an interactive interface for users to answer questions and keep track of their scores.",
    "featuredImage": "/media/projects/jeopardy-game-featured.png",
    "images": [
      "/media/projects/jeopardy-game-featured.png"
    ],
    "live": "https://github.com/oviematthew/jeopardy-game-clone",
    "featured": false
  },
  {
    "name": "Meet The Arunas",
    "slug": "meet-the-arunas",
    "type": "web",
    "jobType": "Freelance",
    "techStack": ["HTML5", "CSS3", "JS", "PHP"],
    "description": "Wedding website for a couple to showcase their love story, gallery and RSVP",
    "longDescription": "Meet The Arunas is a wedding website designed for a couple to showcase their love story, gallery, and RSVP. The website features a clean and modern design, allowing users to easily navigate through the couple's journey and view high-quality images.",
    "featuredImage": "/media/projects/meetthearunas-featured.png",
    "images": [
      "/media/projects/page-images/meetthearunas-1.png"
    ],
    "live": "https://meet-the-arunas.vercel.app/",
    "featured": false
  }

  
]
